app/controllers/admin/products_controller.rb

SELECT  "products".* FROM "products" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
---
  def index
    @products = Product.all.page(params[:page])

UPDATE "products" SET "images" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["images", "[\"diego-hernandez-222506.jpg\"]"], ["updated_at", 2017-05-06 03:33:30 UTC], ["id", 1]]
---
  def update
    if @product.update(product_params)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_product_by_id
    @product = Product.find(params[:id])