app/controllers/products_controller.rb

  def index
    @result = Product.ransack(search_criteria).result(distinct: true).includes("category")
---
SELECT "products".* FROM "products"